cracked-machine/DigitalCurrentSinkV3/SW/STM32L496_DigitalCurrentSinkV3/Src/DacUtilities.c
void DU_setAmplitudeSetting(uint32_t Channel, uint32_t amplitude)
{
	if(Channel == DAC_CHANNEL_1)
		channel1_max_triangle_amplitude = amplitude;
	else
		channel2_max_triangle_amplitude = amplitude;

	printf("DAC_CHANNEL_1 Triangle Amplitude: %s\n", DU_getAmplitudeSetting2String(DAC_CHANNEL_1));
	printf("DAC_CHANNEL_2 Triangle Amplitude: %s\n", DU_getAmplitudeSetting2String(DAC_CHANNEL_2));
}


/**
  * @brief 	set temporary DAC mode (to be applied later on confirmation)
  *
  * @param  pNewMode The new DAC mode
  *         This parameter can be one of the following values:
  *            		DAC_ERROR 	= 	0x00,	// illegal channel request
  *					DAC_USER 	=	0x01,
  *					DAC_AUTO		= 	0x02,
  *					DAC_RAND	= 	0x03
  *
  * @retval none
  */

void DU_SetDACModePreview(uint32_t Channel, dacmode_t pNewMode)
{
	if(Channel == DAC_CHANNEL_1)
		channel1_dacmode_preview = pNewMode;
	else
		channel2_dacmode_preview = pNewMode;

}

/**
  * @brief 	get the temporary DAC mode
  *
  *
  * @retval DAC mode
  *         This parameter can be one of the following values:
  *            		DAC_ERROR 	= 	0x00,	// illegal channel request
  *					DAC_USER 	=	0x01,
  *					DAC_AUTO		= 	0x02,
  *					DAC_RAND	= 	0x03
  */

dacmode_t DU_GetDACModePreview(uint32_t Channel)
{
	if(Channel == DAC_CHANNEL_1)
		return channel1_dacmode_preview;
	else
		return channel2_dacmode_preview;
}



char* DU_GetDACModePreview2String(uint32_t Channel)
{
	if(Channel == DAC_CHANNEL_1)
	{
		switch(channel1_dacmode_preview)
		{
			case DAC_USER:
				return "USER";
				break;
			case DAC_RAND:
				return "RAND";
				break;
			case DAC_AUTO:
				return "AUTO";
				break;
			default:
				break;
		}
	}
	else
	{
		switch(channel2_dacmode_preview)
		{
			case DAC_USER:
				return "USER";
				break;
			case DAC_RAND:
				return "RAND";
				break;
			case DAC_AUTO:
				return "AUTO";
				break;
			default:
				break;

		}
	}

	// something went wrong
	return "ERR:DU146";

}



/**
  * @brief 	Calculate the DAC channel output voltage based
  *  		on chanX_amp_count_preview or DOR register
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  * @param	preview Select chanX_amp_count_preview or DOR register
  *
  * @retval DAC channel output voltage
  */

float DU_CalcDACVolts(uint32_t Channel, uint8_t preview)
{
	float result = 0;
	if(Channel == DAC_CHANNEL_1)
	{
		if(preview)
			result = (float)(VREF * ((float)chan1_amp_count_preview/(float)DACRES));
		else
			result = (float)(VREF * ((float)hdac1.Instance->DOR1/(float)DACRES));
	}
	if(Channel == DAC_CHANNEL_2)
	{
		if(preview)
			result = (float)(VREF * ((float)chan2_amp_count_preview/(float)DACRES));
		else
			result = (float)(VREF * ((float)hdac1.Instance->DOR2/(float)DACRES));
	}
	return result;
}



/**
  * @brief	Calculate the Timer frequency based
  *  		on chanX_freq_count_preview or auto-reload (ARR) register
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  * @param	preview Select the chanX_freq_count_preview or auto-reload (ARR) register
  *
  * @retval The calculated frequency of the timer
  */

float DU_CalcDACFreq(uint32_t Channel, uint8_t preview)
{
	float result = 0;
	if(Channel == DAC_CHANNEL_1)
	{
		if(preview)
			result = (float)MASTERCLK/((float)htim6.Instance->PSC * (float)chan1_freq_count_preview);
		else
			result = (float)MASTERCLK/((float)htim6.Instance->PSC * (float)htim6.Instance->ARR);
	}
	if(Channel == DAC_CHANNEL_2)
	{
		if(preview)
			result = (float)MASTERCLK/((float)htim7.Instance->PSC * (float)chan2_freq_count_preview);
		else
			result = (float)MASTERCLK/((float)htim7.Instance->PSC * (float)htim7.Instance->ARR);
	}
	return result;
}



/**
  * @brief Set chan1_amp_count_preview to new voltage
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  * @param	new_volts The new voltage value to set to chan1_amp_count_preview
  *
  * @retval none
  */

void DU_SetVoltagePreview(uint32_t Channel, float new_volts)
{
	if (Channel == DAC_CHANNEL_1)
	{
		chan1_amp_count_preview = _CalcNewDOR(new_volts);
		printf("New DAC_CHANNEL_1 Volt Request: %2.4fV\n", (float)DU_CalcDACVolts(DAC_CHANNEL_1, 1));
	}

	else if (Channel == DAC_CHANNEL_2)
	{
		chan2_amp_count_preview = _CalcNewDOR(new_volts);
		printf("New DAC_CHANNEL_2 Volt Request: %2.4fV\n", (float)DU_CalcDACVolts(DAC_CHANNEL_2,1));
	}
}

/**
  * @brief	Set the DAC DHR12R1 register to output a new voltage value
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  *
  * @retval none
  */

void DU_SetVoltage(uint32_t Channel)
{
	// start debug counter (DAC requires 1-3 cycles before completing conversion)
	__HAL_TIM_CLEAR_FLAG(&htim15, TIM_FLAG_UPDATE);
	HAL_TIM_Base_Start_IT(&htim15);

	if(DU_isDualChannelMode())
	{
		// update register from the preview variable
		if(chan1_amp_count_preview > (DACRES-1))
		{
			hdac1.Instance->DHR12R1 = (DACRES-1);
			chan1_amp_count_preview = (DACRES-1);
		}
		else
		{
			hdac1.Instance->DHR12R1 = chan1_amp_count_preview;
		}
		// update register from the preview variable
		if(chan2_amp_count_preview > (DACRES-1))
		{
			hdac1.Instance->DHR12R2 = (DACRES-1);
			chan2_amp_count_preview = (DACRES-1);
		}
		else
		{
			hdac1.Instance->DHR12R2 = chan2_amp_count_preview;
		}
	}
	else
	{
		if (Channel == DAC_CHANNEL_1)
		{
			// update register from the preview variable
			if(chan1_amp_count_preview > (DACRES-1))
			{
				hdac1.Instance->DHR12R1 = (DACRES-1);
				chan1_amp_count_preview = (DACRES-1);
			}
			else
			{
				hdac1.Instance->DHR12R1 = chan1_amp_count_preview;
			}

