cracked-machine/DigitalCurrentSinkV3/SW/STM32L496_DigitalCurrentSinkV3/Src/DacUtilities.c
char* DU_GetDACModeActual2String(uint32_t Channel)
{
	volatile uint32_t hdac_cr = hdac1.Instance->CR;
	if (Channel == DAC_CHANNEL_1)
	{
		if	(hdac_cr & DAC_CR_WAVE1_0)
		{
			return "RAND";
		}
		else if (hdac_cr & DAC_CR_WAVE1_1)
		{
			return "AUTO";
		}
		else
		{
			return "USER";
		}
	}
	else if (Channel == DAC_CHANNEL_2)
	{
		if	(hdac_cr & DAC_CR_WAVE2_0)
		{
			return "RAND";
		}
		else if (hdac_cr & DAC_CR_WAVE2_1)
		{
			return "AUTO";
		}
		else
		{
			return "USER";
		}
	}
	else
	{
		return "Error";
	}

}

/**
  * @brief Set the DAC mode for single channel. DAC re-init not required.
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  * @param	mode The selected DAC mode
  * 			@arg 	DAC_ERROR: 	illegal mode request
  *				@arg 	DAC_USER:	Normal mode
  *				@arg 	DAC_AUTO:	Auto mode
  *				@arg 	DAC_RAND:	Random mode
  *
  * @retval none
  */

void DU_SetDACModeActual(uint32_t Channel, dacmode_t mode)
{
	if (Channel == DAC_CHANNEL_1)
	{
		hdac1.Instance->CR &= ~(DAC_CR_WAVE1_Msk | DAC_CR_MAMP1_Msk);
		if(mode == DAC_USER)
			hdac1.Instance->CR &= ~(DAC_CR_WAVE1_0 | DAC_CR_WAVE1_1);
		else if (mode == DAC_RAND)
			hdac1.Instance->CR |= (DAC_CR_WAVE1_0 | DAC_LFSRUNMASK_BITS11_0);
		else if (mode == DAC_AUTO)
			HAL_DACEx_TriangleWaveGenerate(&hdac1, DAC_CHANNEL_1, channel1_max_triangle_amplitude);

	}
	else if (Channel == DAC_CHANNEL_2)
	{
		hdac1.Instance->CR &= ~(DAC_CR_WAVE2_Msk | DAC_CR_MAMP2_Msk);
		if(mode == DAC_USER)
			hdac1.Instance->CR &= ~(DAC_CR_WAVE2_0 | DAC_CR_WAVE2_1);
		else if (mode == DAC_RAND)
			hdac1.Instance->CR |= (DAC_CR_WAVE2_0 | (DAC_LFSRUNMASK_BITS11_0 << (Channel & 0x10UL)));
		else if (mode == DAC_AUTO)
			HAL_DACEx_TriangleWaveGenerate(&hdac1, DAC_CHANNEL_2, channel2_max_triangle_amplitude);

	}
}

/**
  * @brief Set the DAC mode for BOTH channels; Needs to stop and re-initialize the DAC
  *
  * @param	mode The selected DAC mode
  * 			@arg 	DAC_ERROR: 	illegal mode request
  *				@arg 	DAC_USER:	Normal mode
  *				@arg 	DAC_AUTO:	Auto mode
  *				@arg 	DAC_RAND:	Random mode
  *
  * @retval none
  */

void DU_SetDualDACModeActual(dacmode_t mode)
{
	HAL_DAC_Stop(&hdac1,DAC_CHANNEL_1);
	HAL_DAC_Stop(&hdac1,DAC_CHANNEL_2);
	HAL_DAC_DeInit(&hdac1);
	MX_DAC1_Init();


		hdac1.Instance->CR &= ~(DAC_CR_WAVE1_Msk | DAC_CR_MAMP1_Msk);
		if(mode == DAC_USER)
			hdac1.Instance->CR &= ~(DAC_CR_WAVE1_0 | DAC_CR_WAVE1_1);
		else if (mode == DAC_RAND)
			hdac1.Instance->CR |= (DAC_CR_WAVE1_0 | DAC_LFSRUNMASK_BITS11_0);
		else if (mode == DAC_AUTO)
			HAL_DACEx_TriangleWaveGenerate(&hdac1, DAC_CHANNEL_1, channel1_max_triangle_amplitude);


		hdac1.Instance->CR &= ~(DAC_CR_WAVE2_Msk | DAC_CR_MAMP2_Msk);
		if(mode == DAC_USER)
			hdac1.Instance->CR &= ~(DAC_CR_WAVE2_0 | DAC_CR_WAVE2_1);
		else if (mode == DAC_RAND)
			hdac1.Instance->CR |= (DAC_CR_WAVE2_0 | (DAC_LFSRUNMASK_BITS11_0 << (DAC_CHANNEL_2 & 0x10UL)));
		else if (mode == DAC_AUTO)
			HAL_DACEx_TriangleWaveGenerate(&hdac1, DAC_CHANNEL_2, channel2_max_triangle_amplitude);


	HAL_DAC_Start(&hdac1,DAC_CHANNEL_1);
	HAL_DAC_Start(&hdac1,DAC_CHANNEL_2);

}

/**
  * @brief	Debug output for output values. To be called by delayed action to
  * 		allow for 1-3 cycles required before register update
  *
  * @param  Channel The selected DAC channel.
  *         This parameter can be one of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected (Whenever present)
  *
  * @retval none
  */

void DU_CompleteCallback(uint32_t Channel)
{
	if(DU_isDualChannelMode())
	{
		if(DU_GetDACModeActual(DAC_CHANNEL_1) == DAC_USER)
			printf("New DAC_CHANNEL_1 Volt Setting: %2.4fV\n", DU_CalcDACVolts(DAC_CHANNEL_1, 0 ));
		else
			printf("New DAC_CHANNEL_1 Freq Setting: %2.4fHz\n", (float)DU_CalcDACFreq(DAC_CHANNEL_1, 0 ));

		if(DU_GetDACModeActual(DAC_CHANNEL_2) == DAC_USER)
			printf("New DAC_CHANNEL_2 Volt Setting: %2.4fV\n", DU_CalcDACVolts(DAC_CHANNEL_2, 0 ));
		else
			printf("New DAC_CHANNEL_2 Freq Setting: %2.4fHz\n", (float)DU_CalcDACFreq(DAC_CHANNEL_2, 0 ));

	}
	else
	{
		if(Channel == DAC_CHANNEL_1)
		{
			if(DU_GetDACModeActual(DAC_CHANNEL_1) == DAC_USER)
				printf("New DAC_CHANNEL_1 Volt Setting: %2.4fV\n", DU_CalcDACVolts(DAC_CHANNEL_1, 0 ));
			else
				printf("New DAC_CHANNEL_1 Freq Setting: %2.4fHz\n", (float)DU_CalcDACFreq(DAC_CHANNEL_1, 0 ));
		}
		if(Channel == DAC_CHANNEL_2)
		{
			if(DU_GetDACModeActual(DAC_CHANNEL_2) == DAC_USER)
				printf("New DAC_CHANNEL_2 Volt Setting: %2.4fV\n", DU_CalcDACVolts(DAC_CHANNEL_2, 0 ));
			else
				printf("New DAC_CHANNEL_2 Freq Setting: %2.4fHz\n", (float)DU_CalcDACFreq(DAC_CHANNEL_2, 0 ));
		}
	}


}


/**
  * @brief	Set the active DAC channel
  *
  * @param The active DAC channel.
  *         One of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected
  *
  *  @retval None
  */

void DU_setActiveDACChannel(uint32_t Channel)
{
	selected_dac_channel = Channel;
	printf("Active DAC Channel = %s", DU_getActiveDACChannel2String());
}

/**
  * @brief	Get the active DAC channel
  *
  * @retval The active DAC channel.
  *         One of the following values:
  *            	@arg DAC_CHANNEL_1: DAC Channel1 selected
  *            	@arg DAC_CHANNEL_2: DAC Channel2 selected
  *
  */

uint32_t DU_getActiveDACChannel()
{
	return selected_dac_channel;
}

/**
  * @brief	Get the active DAC channel
  *
  * @retval The active DAC channel.
  *         One of the following values:
  *            	@arg "CHANNEL 1"
  *            	@arg "CHANNEL 2"
  *
  */

char* DU_getActiveDACChannel2String()
{
	if(selected_dac_channel == DAC_CHANNEL_1)
		return "CH1";
	else
		return "CH2";
}

/**
  * @brief	Set the DAC dual mode status
  *
  * @param enable: 1=Dual Mode enabled, 0=Dual Mode disabled
  *
  * @retval None
  */

